
export const system =`使用nodejs开发一个节点软件：
1. 每个节点运行在不同的局域网内，局域网出口安装有NAT；
2. 节点软件使用dht协议发布自己的公网地址，获得其它节点的公网地址，并进行通信；
3. 只开发节点软件，不开发任何服务器端的代码。节点在建立连接时可以借助已经存在的第三方服务器，要求在中国大陆可以使用，同一方法有多个互相替换的服务器可选择；
4. 通信时不能使用服务器，把通信时间、内容、大致内容长度、各方网址都控制在最小知情范围内。
如果需要使用stun服务器，使用：
{ urls: 'stun:fwa.lifesizecloud.com:3478' },
{ urls: 'stun:stun.isp.net.au:3478' },
{ urls: 'stun:stun.freeswitch.org:3478' },
{ urls: 'stun:stun.voip.blackberry.com:3478' }
如果需要使用dht的BOOTSTRAPS，使用：
    { host: '34.197.35.250', port: 6880 },
    { host: '72.46.58.63', port: 51413 },
    { host: '46.53.251.68', port: 16970 },
    { host: '191.95.16.229', port: 55998 },
    { host: '79.173.94.111', port: 1438 },
    { host: '45.233.86.50', port: 61995 },
    { host: '178.162.174.28', port: 28013 },
    { host: '178.162.174.240', port: 28006 },
    { host: '72.21.17.101', port: 22643 },
    { host: '31.181.42.46', port: 22566 },
    { host: '67.213.106.46', port: 61956 },
    { host: '201.131.172.249', port: 53567 },
    { host: '185.203.152.184', port: 2003 },
    { host: '68.146.23.207', port: 42107 },
    { host: '51.195.222.183', port: 8653 },
    { host: '85.17.170.48', port: 28005 },
    { host: '87.98.162.88', port: 6881 },
    { host: '185.145.245.121', port: 8656 },
    { host: '52.201.45.189', port: 6880 }
在停止运行时，把当前可用的ip、port显示出来，以便作为今后的dht的BOOTSTRAPS。
5. 要求由非IT专业用户，下载后开箱即用。支持windows、linux操作系统。
`;
